Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedTemperatureLoad
Serialization structure for AnalysisDecomposedTemperatureLoad.

Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedTemperatureLoad.AnalysisDecomposedLoad
The analysis decomposed load.

Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedTemperatureLoad._AxialTemperatureDifference
The axial temperature difference of the analysis decomposed temperature load.

Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedTemperatureLoad._VerticalTemperatureDifference
The vertical temperature difference of the analysis decomposed temperature load.

Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedTemperatureLoad._HorizontalTemperatureDifference
The horizontal temperature difference of the analysis decomposed temperature load.

Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedTemperatureLoad._Strain
The strain of the analysis decomposed temperature load.

Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedTemperatureLoad.ToStruct(Tekla.Structures.Analysis.AnalysisDecomposedTemperatureLoad)
DO NOT USE! For internal usage only!
P: P.

Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedTemperatureLoad.FromStruct(Tekla.Structures.Analysis.AnalysisDecomposedTemperatureLoad)
DO NOT USE! For internal usage only!
P: P.